{
  "char2idx": {
    "<BLANK>": 0,
    "<PAD>": 1,
    " ": 2,
    "!": 3,
    "%": 4,
    "(": 5,
    ")": 6,
    "+": 7,
    ",": 8,
    "-": 9,
    ".": 10,
    "/": 11,
    "0": 12,
    "1": 13,
    "2": 14,
    "3": 15,
    "4": 16,
    "5": 17,
    "6": 18,
    "7": 19,
    "8": 20,
    "9": 21,
    ":": 22,
    "A": 23,
    "B": 24,
    "C": 25,
    "D": 26,
    "E": 27,
    "G": 28,
    "H": 29,
    "K": 30,
    "M": 31,
    "N": 32,
    "P": 33,
    "Q": 34,
    "R": 35,
    "S": 36,
    "T": 37,
    "U": 38,
    "V": 39,
    "X": 40,
    "Y": 41,
    "Z": 42,
    "a": 43,
    "b": 44,
    "c": 45,
    "d": 46,
    "e": 47,
    "f": 48,
    "g": 49,
    "h": 50,
    "i": 51,
    "j": 52,
    "k": 53,
    "l": 54,
    "m": 55,
    "n": 56,
    "o": 57,
    "p": 58,
    "q": 59,
    "r": 60,
    "s": 61,
    "t": 62,
    "u": 63,
    "v": 64,
    "x": 65,
    "y": 66,
    "z": 67,
    "|": 68,
    "Ö": 69,
    "Ü": 70,
    "ç": 71,
    "ö": 72,
    "ü": 73,
    "ğ": 74,
    "İ": 75,
    "ı": 76,
    "Ş": 77,
    "ş": 78,
    "Ə": 79,
    "ə": 80,
    "№": 81
  },
  "idx2char": {
    "0": "<BLANK>",
    "1": "<PAD>",
    "2": " ",
    "3": "!",
    "4": "%",
    "5": "(",
    "6": ")",
    "7": "+",
    "8": ",",
    "9": "-",
    "10": ".",
    "11": "/",
    "12": "0",
    "13": "1",
    "14": "2",
    "15": "3",
    "16": "4",
    "17": "5",
    "18": "6",
    "19": "7",
    "20": "8",
    "21": "9",
    "22": ":",
    "23": "A",
    "24": "B",
    "25": "C",
    "26": "D",
    "27": "E",
    "28": "G",
    "29": "H",
    "30": "K",
    "31": "M",
    "32": "N",
    "33": "P",
    "34": "Q",
    "35": "R",
    "36": "S",
    "37": "T",
    "38": "U",
    "39": "V",
    "40": "X",
    "41": "Y",
    "42": "Z",
    "43": "a",
    "44": "b",
    "45": "c",
    "46": "d",
    "47": "e",
    "48": "f",
    "49": "g",
    "50": "h",
    "51": "i",
    "52": "j",
    "53": "k",
    "54": "l",
    "55": "m",
    "56": "n",
    "57": "o",
    "58": "p",
    "59": "q",
    "60": "r",
    "61": "s",
    "62": "t",
    "63": "u",
    "64": "v",
    "65": "x",
    "66": "y",
    "67": "z",
    "68": "|",
    "69": "Ö",
    "70": "Ü",
    "71": "ç",
    "72": "ö",
    "73": "ü",
    "74": "ğ",
    "75": "İ",
    "76": "ı",
    "77": "Ş",
    "78": "ş",
    "79": "Ə",
    "80": "ə",
    "81": "№"
  },
  "vocab_size": 82
}