{
  "char_to_idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "\n": 2,
    " ": 3,
    "!": 4,
    "%": 5,
    "(": 6,
    ")": 7,
    "+": 8,
    ",": 9,
    "-": 10,
    ".": 11,
    "/": 12,
    "0": 13,
    "1": 14,
    "2": 15,
    "3": 16,
    "4": 17,
    "5": 18,
    "6": 19,
    "7": 20,
    "8": 21,
    "9": 22,
    ":": 23,
    "A": 24,
    "B": 25,
    "C": 26,
    "D": 27,
    "E": 28,
    "G": 29,
    "H": 30,
    "K": 31,
    "M": 32,
    "N": 33,
    "P": 34,
    "Q": 35,
    "R": 36,
    "S": 37,
    "T": 38,
    "U": 39,
    "V": 40,
    "X": 41,
    "Y": 42,
    "Z": 43,
    "a": 44,
    "b": 45,
    "c": 46,
    "d": 47,
    "e": 48,
    "f": 49,
    "g": 50,
    "h": 51,
    "i": 52,
    "j": 53,
    "k": 54,
    "l": 55,
    "m": 56,
    "n": 57,
    "o": 58,
    "p": 59,
    "q": 60,
    "r": 61,
    "s": 62,
    "t": 63,
    "u": 64,
    "v": 65,
    "x": 66,
    "y": 67,
    "z": 68,
    "|": 69,
    "Ö": 70,
    "Ü": 71,
    "ç": 72,
    "ö": 73,
    "ü": 74,
    "ğ": 75,
    "İ": 76,
    "ı": 77,
    "Ş": 78,
    "ş": 79,
    "Ə": 80,
    "ə": 81,
    "№": 82
  },
  "idx_to_char": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "\n",
    "3": " ",
    "4": "!",
    "5": "%",
    "6": "(",
    "7": ")",
    "8": "+",
    "9": ",",
    "10": "-",
    "11": ".",
    "12": "/",
    "13": "0",
    "14": "1",
    "15": "2",
    "16": "3",
    "17": "4",
    "18": "5",
    "19": "6",
    "20": "7",
    "21": "8",
    "22": "9",
    "23": ":",
    "24": "A",
    "25": "B",
    "26": "C",
    "27": "D",
    "28": "E",
    "29": "G",
    "30": "H",
    "31": "K",
    "32": "M",
    "33": "N",
    "34": "P",
    "35": "Q",
    "36": "R",
    "37": "S",
    "38": "T",
    "39": "U",
    "40": "V",
    "41": "X",
    "42": "Y",
    "43": "Z",
    "44": "a",
    "45": "b",
    "46": "c",
    "47": "d",
    "48": "e",
    "49": "f",
    "50": "g",
    "51": "h",
    "52": "i",
    "53": "j",
    "54": "k",
    "55": "l",
    "56": "m",
    "57": "n",
    "58": "o",
    "59": "p",
    "60": "q",
    "61": "r",
    "62": "s",
    "63": "t",
    "64": "u",
    "65": "v",
    "66": "x",
    "67": "y",
    "68": "z",
    "69": "|",
    "70": "Ö",
    "71": "Ü",
    "72": "ç",
    "73": "ö",
    "74": "ü",
    "75": "ğ",
    "76": "İ",
    "77": "ı",
    "78": "Ş",
    "79": "ş",
    "80": "Ə",
    "81": "ə",
    "82": "№"
  },
  "num_classes": 84,
  "vocab_size": 83
}