{
  "char_to_idx": {
    "\n": 0,
    " ": 1,
    "!": 2,
    "%": 3,
    "(": 4,
    ")": 5,
    "+": 6,
    ",": 7,
    "-": 8,
    ".": 9,
    "/": 10,
    "0": 11,
    "1": 12,
    "2": 13,
    "3": 14,
    "4": 15,
    "5": 16,
    "6": 17,
    "7": 18,
    "8": 19,
    "9": 20,
    ":": 21,
    "A": 22,
    "B": 23,
    "C": 24,
    "D": 25,
    "E": 26,
    "G": 27,
    "H": 28,
    "K": 29,
    "M": 30,
    "N": 31,
    "P": 32,
    "Q": 33,
    "R": 34,
    "S": 35,
    "T": 36,
    "U": 37,
    "V": 38,
    "X": 39,
    "Y": 40,
    "Z": 41,
    "a": 42,
    "b": 43,
    "c": 44,
    "d": 45,
    "e": 46,
    "f": 47,
    "g": 48,
    "h": 49,
    "i": 50,
    "j": 51,
    "k": 52,
    "l": 53,
    "m": 54,
    "n": 55,
    "o": 56,
    "p": 57,
    "q": 58,
    "r": 59,
    "s": 60,
    "t": 61,
    "u": 62,
    "v": 63,
    "x": 64,
    "y": 65,
    "z": 66,
    "|": 67,
    "Ö": 68,
    "Ü": 69,
    "ç": 70,
    "ö": 71,
    "ü": 72,
    "ğ": 73,
    "İ": 74,
    "ı": 75,
    "Ş": 76,
    "ş": 77,
    "Ə": 78,
    "ə": 79,
    "№": 80
  },
  "idx_to_char": {
    "0": "\n",
    "1": " ",
    "2": "!",
    "3": "%",
    "4": "(",
    "5": ")",
    "6": "+",
    "7": ",",
    "8": "-",
    "9": ".",
    "10": "/",
    "11": "0",
    "12": "1",
    "13": "2",
    "14": "3",
    "15": "4",
    "16": "5",
    "17": "6",
    "18": "7",
    "19": "8",
    "20": "9",
    "21": ":",
    "22": "A",
    "23": "B",
    "24": "C",
    "25": "D",
    "26": "E",
    "27": "G",
    "28": "H",
    "29": "K",
    "30": "M",
    "31": "N",
    "32": "P",
    "33": "Q",
    "34": "R",
    "35": "S",
    "36": "T",
    "37": "U",
    "38": "V",
    "39": "X",
    "40": "Y",
    "41": "Z",
    "42": "a",
    "43": "b",
    "44": "c",
    "45": "d",
    "46": "e",
    "47": "f",
    "48": "g",
    "49": "h",
    "50": "i",
    "51": "j",
    "52": "k",
    "53": "l",
    "54": "m",
    "55": "n",
    "56": "o",
    "57": "p",
    "58": "q",
    "59": "r",
    "60": "s",
    "61": "t",
    "62": "u",
    "63": "v",
    "64": "x",
    "65": "y",
    "66": "z",
    "67": "|",
    "68": "Ö",
    "69": "Ü",
    "70": "ç",
    "71": "ö",
    "72": "ü",
    "73": "ğ",
    "74": "İ",
    "75": "ı",
    "76": "Ş",
    "77": "ş",
    "78": "Ə",
    "79": "ə",
    "80": "№"
  },
  "blank_idx": 81,
  "vocab_size": 81,
  "num_classes": 82
}